-- Результат пуст, так как Ярослав - последнее имя в алфавитном порядке
SELECT
	"Н_ЛЮДИ"."ИМЯ",
	"Н_ВЕДОМОСТИ"."ДАТА"
FROM
	"Н_ЛЮДИ"
INNER JOIN
	"Н_ВЕДОМОСТИ"
ON
	"Н_ЛЮДИ"."ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
WHERE
	"Н_ЛЮДИ"."ИМЯ" > 'Ярослав' AND
	"Н_ВЕДОМОСТИ"."ДАТА" = '1998-01-05'
;


-- Вывод пуст, так как единственный Ярослав 2011-11-21 имеет НЗК 081194
SELECT
	"Н_ЛЮДИ"."ОТЧЕСТВО",
	"Н_ОБУЧЕНИЯ"."НЗК",
	"Н_УЧЕНИКИ"."НАЧАЛО"
FROM
	"Н_УЧЕНИКИ"
RIGHT JOIN
	"Н_ОБУЧЕНИЯ"
ON
	"Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД"
RIGHT JOIN
	"Н_ЛЮДИ"
ON
	"Н_ЛЮДИ"."ИД" = "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД"
WHERE
	"Н_ЛЮДИ"."ИМЯ" = 'Ярослав' AND
	"Н_ОБУЧЕНИЯ"."НЗК" < '001000' AND
	"Н_УЧЕНИКИ"."НАЧАЛО" = '2011-11-21'
;

